{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "What should I be looking for in a good/ethical/reputable preservation Devon Rex breeder?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "We understand the high demand for kittens and retired cats, but ethically, we cannot meet every request. Imagine how many kittens we would have to have in order to do that! That’s why we strongly encourage you to find a reputable breeder. If you’d like referrals or recommendations, feel free to email us or check out our links page—we’re happy to connect you with breeders we know and trust.\n\nHere are key factors to consider when choosing a breeder:\n\n1. **Registration with Reputable Associations:**\nEnsure the cats and kittens are registered with reputable associations such as CFA and/or TICA. If a breeder offers \"no papers\" or \"unregistered\" kittens, ask why. This could indicate they lack breeding rights or that the cats may not be purebred. Registering a kitten costs only $15–$25 USD, so a lack of papers is a red flag.\n\n*Note:* Some hybrids are permitted by associations to diversify the Devon Rex genetic pool. Approved hybrids are still eligible for registration.\n\n2. **Participation in Cat Shows:**\nEthical breeders actively participate in cat shows to validate their breeding program and gain unbiased feedback. While some may cite cost or concerns about disease exposure, responsible breeders follow strict protocols to prevent health risks. Proper hygiene, preparation, and post-show care help minimize potential issues.\n\n3. **Membership in Breed Clubs:**\nMembership in breed clubs (e.g., The Devon Rex Breed Club or \"DRBC\") helps breeders stay informed on broader breed developments. It also indicates adherence to a code of ethics and offers some recourse for new owners if issues arise. Breeders who are members have typically shown a cat to Grand status, demonstrating a strong understanding of the breed standard.\n\n4. **Financial Transparency:**\nWhere does the money from kittens go? Ours goes back into ensuring the health and welfare of our cats, including veterinary exams, genetic testing, a biologically appropriate diet, showing in front of people who know cats and the breed, traveling with cats safely, not to mention equipment and time away from work and family. If they are not doing these things, where does that money go? There's an old saying that good breeders don't make money, and in my time in this hobby, that's true. Most lose a little, and some, if they are careful and frugal, come out close to even. Beware the person who is charging the full price and has nothing to show for it. Because there is no governing authority for breeders in Canada (or the US for that matter), it is entirely up to the new owner to do their own research and due diligence.\n\n*Note:* If they are charging a small(ish) adoption fee. Frequently, we see people pointing to Kijiji or other online ads where kittens are half price or less of what most ethical breeders will charge. Cost alone, by no means is an indicator of quality! But if a price seems too good to be true, it often is. Find out what you are receiving for the price. If they cannot attest to the things here that have been outlined, look the other way, no matter how cute that kitten is. Please don't support irresponsible greedy breeders who are only trying to pad their wallets, nor misinformed naïve ones.\n\n5. **Testing for Physical and Genetic Issues:**\nIn order to save yourself heartbreak, sick kittens/cats, and potentially large vet bills later, it's important that you find a breeder whose breeding stock is tested for genetic issues common to the breed. Some should be done yearly, and some just once to prove they don't carry the gene that causes the problem. No breed is without potential issues, and it is up to us as breeders to ensure that our lines are healthy and represent the best the breed has to offer. We are, after all, responsible for bringing these tiny creatures into the world, and we have a duty to ensure they have the best possible shot at living a long, healthy, happy, and loved life with their new families. It's also relevant to note that if both parents have tested negative for certain issues, the kitten, by default, will be negative as well. Each breed has its own things to test for. In Devons, the most common ailments are PKD, CMS, and newly emerging retinal atrophy, along with HCM. The first three can be tested for via genetic screening. HCM, however, requires regular heart health monitoring of breeding adults via an echocardiogram.\n\nI cannot stress enough how important it is that you find a breeder that does these things. I urge you to think critically if someone tries to tell you these aren't an issue with our breed or any other excuse not to do these screenings. Because that is, unfortunately, patently false. It is also no longer sufficient in this day and age to have only an FIV and FeLV free cattery. Those should be a given. Reputable breeders do better and are always striving to improve the breed's health. Please be a part of that ideology and expect this bare minimum from whatever breeder you choose.\n\n6. **Cleanliness and Grooming:**\nRegarding the pictures they send, or once you've seen them in person, do they have clean eyes and ears, and bums? Are their eyes bright and shiny? These things, while they sound aesthetic, are a testament to how well they have been cared for and looked after, as well as indicative of the environment they were raised in. Look at their pictures; do you see crusty half-closed eyes (sick)? Lots of ear dirt? Devons are somewhat known for ear dirt, but it takes but a moment to clean our babies' ears. Attention to the kittens brought into this world is important. This reflects that.\n\n7. **Breed Knowledge:**\nMake sure the person you are dealing with can answer questions about the breed, can talk about what issues the breed can have and how and why they have chosen the cats they breed to better those traits. They should also be able to talk about their own lines and what they are striving to improve. This includes but should not be limited to common breed concerns (like CMS, PKD, and HCM), color genetics and nomenclature, their own cats' pedigrees, and how and why they chose those cats. **Beware if someone is not willing or able to discuss these things with you.**\n\n8. **Kitten Age at Adoption:**\nKittens should not leave their breeder before 14–16 weeks of age, with at least three sets of vaccinations (minimum two). Early separation can negatively impact their health and behavior."
      }
    }
  ]
},

   {
  "@type": "Question",
  "name": "Do you charge a fee to apply for a Devon Rex kitten?",
  "acceptedAnswer": {
    "@type": "Answer",
    "text": "No, we do NOT charge any fee to apply for a kitten, nor do we charge to be on the waitlist. Here’s why:\n\nWe can’t predict the number of kittens born in a litter or guarantee how many will be show-quality, breeding-worthy, or pet-quality. Taking deposits on kittens before they are born or evaluated doesn’t feel right to us.\n\nAdditionally, we don’t support deposits on neonate kittens (under 4 weeks old) due to their fragile nature. Kittens’ personalities begin to show around 4-5 weeks, and we make careful decisions to ensure a good match for both the kitten and the new owner.\n\nWhile some breeders use deposits to gauge serious buyers, we prefer to wait until kittens are evaluated by us, have received their first well-baby exam and vaccinations (typically at 8 weeks), and have met prospective owners. This ensures a thoughtful, informed placement."
  }
},
    {
      "@type": "Question",
      "name": "Question 3: Do you have any kittens for sale?"
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 3: No, generally speaking we do not have kittens readily available for sale. This is because we typically have a wait list of people who have applied for a kitten and been approved in advance. However, please see our "kittens" page (located under "our cats" in the menu) for more information on what litter(s) may be planned in the near future."
      }
    },
    {
      "@type": "Question",
      "name": "Question 4: What is the cost of a PureX Devon Rex kitten?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 4: Please see the "what to expect" page. It goes over price of kittens and what is included, in detail. "
      }
    },
  {
  "@type": "Question",
  "name": "Question 5: My friend/coworker/family member is telling me it's terrible to buy from a breeder and I should rescue a kitten instead. What should I say?",
  "acceptedAnswer": {
    "@type": "Answer",
    "text": "Answer 5: Well, that depends on your relationship with them and how willing they are to have an actual conversation about the pros and cons. Firstly, let me start by saying if you want to rescue, please do so! Rescue is incredibly important. We have numerous PureX families that have rescue cats and dogs. ...\n\nSo why is a reputable breeder different? How are they part of the solution to help prevent pets in shelters? Typically a reputable breeder does the following things to ensure their cats and kittens never wind up contributing to the overpopulation of shelters and rescues..."
  }
},
    {
      "@type": "Question",
      "name": "Question 6: Are Devon Rex hypoallergenic?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 6: No. There is no such thing as a fully hypoallergenic cat in the most widely recognized meaning of the word. Despite what you may have read. All cats create the proteins that cause allergies in humans. Technically, being hypoallergenic just means less allergenic, not no allergens. But most people associate it with being an allergy safe option. But they are not. 
"
      }
    },
    {
      "@type": "Question",
      "name": "Question 7: Are Devon Rex considered non-shedding?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 7: No. Again, no animal with fur is truly non shedding. Not dogs or cats. But there are varying degrees, and most Devons shed very little-often far less than your average cats. Additionally you may find people that raise Devons to look very much like Sphynx. With very little fur at all. This is not the breed standard, and as we actively show, we do aim to breed to the standard. There will be some variation even in the same litter, but do not expect your kitten to be bald.​ You will also typically see that most Devon kittens go through some degree of molting(losing their coat) around 8 weeks of age and coming back around 5 or 6 months though it can take up to a year to get their full coat back in. However, a good indicator of whether a kitten will have coat(and to what degree) when they get older  are if both parents and all grandparents have coat and how well coated those adults are. However, there are a few breeds that can be "easier" on allergies than others. Devon Rex do fit into that category. For people with mild to moderate cat allergies, Devons may provide some relief, as they tend to have minimal shedding, therefor less ways to leave their proteins in their environment."
      }
    },
{
  "@type": "Question",
  "name": "Question 8: Can I come check out your cats to see if I am allergic?",
  "acceptedAnswer": {
    "@type": "Answer",
    "text": "Answer 8: We do allow you to come and visit the kitten you are potentially going to take home, if you are...\n1. In town and\n2. We don't have any unvaccinated neonates at that time.\n\nHowever, because we also have two exotic shorthairs, as well as our dogs, ours is NOT a place we recommend to test for allergies. Truth be told though, we used to have the ability to have people visit a friend who had just 3 Devons, and all allergic visitors had some type of reaction, even if mild.\n\nAs discussed in other questions here, they are not hypoallergenic, but might provide some relief to those with mild allergies, or those with mild-moderate allergies who are willing to take medication."
  }
},
    {
      "@type": "Question",
      "name": "Question 9: Do you ship your kittens or cats?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 9: No. For felines in particular it is not a good or safe way to travel. Exposure to significant stress(the biggest predictor of illness in cats), smells, and even contagious airborne illnesses, it is not something we are willing to subject our cats to. You are required to come in person to collected your new family member, or you are able to hire, at your cost, a courier to bring your kitten to you and travel in cabin with your new kitten/cat(this ranges from 400-600 US for most places in Canada or the US)"
      }
    },
  {
  "@type": "Question",
  "name": "Question 10: How are your cats/kittens socialized?",
  "acceptedAnswer": {
    "@type": "Answer",
    "text": "Answer 10: Our kittens and cats are socialized from birth with constant handling, raised strictly in our home, and introduced to other cats and dogs as they progress and are properly vaccinated. We also get them accustomed to weekly baths to help them become familiar with the feeling and sound of water, should their future homes need to bathe them. While few cats enjoy baths, this practice helps them stay comfortable. Maintaining this routine is important to avoid them becoming fearful or combative during baths."
  }
},

    {
  "@type": "Question",
  "name": "Question 11: I want to breed Devons! Can I buy a breeding cat from you?",
  "acceptedAnswer": {
    "@type": "Answer",
    "text": "Answer 11: The short answer is no. The long answer is that I work with people I've established relationships with, those I've met through shows and who share my ethical standards for breeding. Trust takes time. These are my cats, and I want to ensure that the lines I've worked hard to build are respected. If you're interested in breeding, I suggest starting with an altered prospect for showing. This will help you meet others, gain experience, and establish the necessary relationships."
  }
},
{
  "@type": "Question",
  "name": "Question 12: What is pet insurance and why do you include it?",
  "acceptedAnswer": {
    "@type": "Answer",
    "text": "Answer 12: Pet insurance helps cover the costs of veterinary care for accidents or illnesses. We offer a 6-week insurance trial with each kitten and recommend continuing it. While we strive to avoid breed-related issues, accidents and illnesses can still occur. From playful kittens injuring themselves to unexpected medical needs, insurance ensures that you won’t have to choose between your pet’s health and your finances. We personally find that having coverage provides peace of mind and prevents financial strain in times of need."
  }
},

    {
      "@type": "Question",
      "name": "Question 13: Do you shave/perm/curl their fur to look that way?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 13: No, aside from show baths, and keeping ears and faces clean, there is not much left in the way of grooming Devons. This is really how they look, as nature intended!"
      }
    },
    {
  "@type": "Question",
  "name": "Question 14: Do you have any longhaired Devons for sale?",
  "acceptedAnswer": {
    "@type": "Answer",
    "text": "Answer 14: No, we do not have longhaired Devon Rex cats for sale. Longhair is not part of the breed standard for Devon Rex cats according to CFA, TICA, ACFA, and CCA. Breeding longhaired Devons goes against the breed's standard and often indicates that genetic testing has not been conducted. While some breeders might occasionally produce longhaired kittens, this is not ethical or consistent with the breed's established traits. For those interested in longhaired cats, consider looking into breeds like Selkirk Rex, Tennessee Rex, or LaPerm."
  }
}
  ]
}

