{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "What should I be looking for in a good/ethical/reputable preservation Devon Rex breeder?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "We understand the high demand for kittens and retired cats, but ethically, we cannot meet every request. Imagine how many kittens we would have to have in order to do that! That’s why we strongly encourage you to find a reputable breeder. If you’d like referrals or recommendations, feel free to email us or check out our links page—we’re happy to connect you with breeders we know and trust.\n\nHere are key factors to consider when choosing a breeder:\n\n1. **Registration with Reputable Associations:**\nEnsure the cats and kittens are registered with reputable associations such as CFA and/or TICA. If a breeder offers \"no papers\" or \"unregistered\" kittens, ask why. This could indicate they lack breeding rights or that the cats may not be purebred. Registering a kitten costs only $15–$25 USD, so a lack of papers is a red flag.\n\n*Note:* Some hybrids are permitted by associations to diversify the Devon Rex genetic pool. Approved hybrids are still eligible for registration.\n\n2. **Participation in Cat Shows:**\nEthical breeders actively participate in cat shows to validate their breeding program and gain unbiased feedback. While some may cite cost or concerns about disease exposure, responsible breeders follow strict protocols to prevent health risks. Proper hygiene, preparation, and post-show care help minimize potential issues.\n\n3. **Membership in Breed Clubs:**\nMembership in breed clubs (e.g., The Devon Rex Breed Club or \"DRBC\") helps breeders stay informed on broader breed developments. It also indicates adherence to a code of ethics and offers some recourse for new owners if issues arise. Breeders who are members have typically shown a cat to Grand status, demonstrating a strong understanding of the breed standard.\n\n4. **Financial Transparency:**\nWhere does the money from kittens go? Ours goes back into ensuring the health and welfare of our cats, including veterinary exams, genetic testing, a biologically appropriate diet, showing in front of people who know cats and the breed, traveling with cats safely, not to mention equipment and time away from work and family. If they are not doing these things, where does that money go? There's an old saying that good breeders don't make money, and in my time in this hobby, that's true. Most lose a little, and some, if they are careful and frugal, come out close to even. Beware the person who is charging the full price and has nothing to show for it. Because there is no governing authority for breeders in Canada (or the US for that matter), it is entirely up to the new owner to do their own research and due diligence.\n\n*Note:* If they are charging a small(ish) adoption fee. Frequently, we see people pointing to Kijiji or other online ads where kittens are half price or less of what most ethical breeders will charge. Cost alone, by no means is an indicator of quality! But if a price seems too good to be true, it often is. Find out what you are receiving for the price. If they cannot attest to the things here that have been outlined, look the other way, no matter how cute that kitten is. Please don't support irresponsible greedy breeders who are only trying to pad their wallets, nor misinformed naïve ones.\n\n5. **Testing for Physical and Genetic Issues:**\nIn order to save yourself heartbreak, sick kittens/cats, and potentially large vet bills later, it's important that you find a breeder whose breeding stock is tested for genetic issues common to the breed. Some should be done yearly, and some just once to prove they don't carry the gene that causes the problem. No breed is without potential issues, and it is up to us as breeders to ensure that our lines are healthy and represent the best the breed has to offer. We are, after all, responsible for bringing these tiny creatures into the world, and we have a duty to ensure they have the best possible shot at living a long, healthy, happy, and loved life with their new families. It's also relevant to note that if both parents have tested negative for certain issues, the kitten, by default, will be negative as well. Each breed has its own things to test for. In Devons, the most common ailments are PKD, CMS, and newly emerging retinal atrophy, along with HCM. The first three can be tested for via genetic screening. HCM, however, requires regular heart health monitoring of breeding adults via an echocardiogram.\n\nI cannot stress enough how important it is that you find a breeder that does these things. I urge you to think critically if someone tries to tell you these aren't an issue with our breed or any other excuse not to do these screenings. Because that is, unfortunately, patently false. It is also no longer sufficient in this day and age to have only an FIV and FeLV free cattery. Those should be a given. Reputable breeders do better and are always striving to improve the breed's health. Please be a part of that ideology and expect this bare minimum from whatever breeder you choose.\n\n6. **Cleanliness and Grooming:**\nRegarding the pictures they send, or once you've seen them in person, do they have clean eyes and ears, and bums? Are their eyes bright and shiny? These things, while they sound aesthetic, are a testament to how well they have been cared for and looked after, as well as indicative of the environment they were raised in. Look at their pictures; do you see crusty half-closed eyes (sick)? Lots of ear dirt? Devons are somewhat known for ear dirt, but it takes but a moment to clean our babies' ears. Attention to the kittens brought into this world is important. This reflects that.\n\n7. **Breed Knowledge:**\nMake sure the person you are dealing with can answer questions about the breed, can talk about what issues the breed can have and how and why they have chosen the cats they breed to better those traits. They should also be able to talk about their own lines and what they are striving to improve. This includes but should not be limited to common breed concerns (like CMS, PKD, and HCM), color genetics and nomenclature, their own cats' pedigrees, and how and why they chose those cats. **Beware if someone is not willing or able to discuss these things with you.**\n\n8. **Kitten Age at Adoption:**\nKittens should not leave their breeder before 14–16 weeks of age, with at least three sets of vaccinations (minimum two). Early separation can negatively impact their health and behavior. You can read more about that here.\n\n9. **Sp
::contentReference[oaicite:0]{index=0}
    {
      "@type": "Question",
      "name": "Question 2: Do you charge a fee to apply for a Devon Rex kitten?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 2: NO. We do NOT charge any fee to apply for a cat/kitten NOR do we charge to be on the waitlist and these are our reasons...
​
We do not know how many kittens will be born in each litter. 
	   Even ultrasounds/x-rays can be read incorrectly, and asking someone to put a down payment 			
	   on something that doesn't yet exist, and may not exist, is not something we are comfortable 
	   with.
​
Even if we did know exactly how many kittens we would have, we do not know how many might be show quality, or might stay here to help our breeding program, or who might be pet quality. 
	  If someone already know all their kittens will be pet quality, one may want to ask what they are 		
	  breeding for, and why they believe breeding those two particular cats together is a good idea. 
	  It goes so much beyond having two purebred cats. There is after-all a difference between 
	  purebred and well-bred.

 Putting a deposit down on a neonate (any kitten under 4 weeks of age) is a practice we don't support. 
	  Neonatal kittens are fragile and more susceptible to health issues, including fading kitten 		
	  syndrome, simple infections, and many other possible things. Mortality rates for kittens are 
	  highest in the first few weeks, and promising kittens too early can lead to heartbreak at a 
	  minimum. 

	  Furthermore some kittens may not develop as expected (whether that be personality wise, 	
	  structure or type), and making commitments too soon can lead to mismatched placements 
	  with a new home, leading to potentially broken hearts or re-homing situations later on. A 
	  kittens individual personality doesn't really "start" to show until 4-5 weeks of age and waiting 
	  to a more appropriate time allows us to make informed decisions about which kitten suits 
	  which home. We have a duty as breeders to evaluate each kitten thoroughly before selecting 
	  the best homes. This is one way in which we prioritize the kittens' well-being over quick/early 
	  reservations.
​
Some breeders will say it helps them define who is "serious" about getting a kitten. 
	  We take that into account and understand some people may change their mind or find a kitten 
	  elsewhere (because honestly waiting is no fun. - I've been there). Ultimately though, that 
	  means they weren't meant to be for one of our kittens.
​
As such, we do not choose to place a deposit of any kind until kittens have been evaluated by us and have gone through their first well baby exams with a licensed veterinarian and first vaccinations(typically 8 weeks) AND been met by their new prospective homes(virtually or otherwise).  "
      }
    },
    {
      "@type": "Question",
      "name": "Question 3: Do you have any kittens for sale?"
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 3: No, generally speaking we do not have kittens readily available for sale. This is because we typically have a wait list of people who have applied for a kitten and been approved in advance. However, please see our "kittens" page (located under "our cats" in the menu) for more information on what litter(s) may be planned in the near future."
      }
    },
    {
      "@type": "Question",
      "name": "Question 4: What is the cost of a PureX Devon Rex kitten?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 4: Please see the "what to expect" page. It goes over price of kittens and what is included, in detail. "
      }
    },
    {
      "@type": "Question",
      "name": "Question 5: My friend/coworker/family member is telling me it's terrible to buy from a breeder and I should rescue a kitten instead. What should I say?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 5: Well that depends on your relationship with them and how willing they are to have an actual conversation about the pros and cons.
 
Firstly, let me start this by saying if you want to rescue, please do so! Rescue is terribly important. We have numerous PureX families that have rescue cats and dogs.

The very first question in the a pet overpopulation problem is "Where do all these homeless shelter/rescue pets come from?".
The answer? Well it's from a few sources...
(Here’s a handy link with a peer reviewed study - just 5% of pets in shelters are purebred. Feel free to google "where do shelter pets come from?" for more examples... http://www.shelterproject.naiaonline.org/purebred/)

1) From pet owners who don't spay or neuter their pets, having an "oops" litter, or "wanting to experience the magic of birth" or "just one litter before they're fixed" because they've heard some old wives tale that that is somehow better-it's not. Ask literally any veterinarian. A sub section of this category is for those who have two animals of the same breed, or close to the same breed, or sometimes just the same general size and create deliberate "designer" mixes to unsuspecting buyers (these "breeders" also fall into the "backyard or puppy/kitten mill" which I will touch on in a later point).

2) People who allow their pets to roam freely while intact. Farm cats/dogs, dogs that pack together when left in numbers(again-unaltered by choice), they breed, continue to not be fixed generation upon generation and are brought in by rescues or shelters to find homes.
 
3) Backyard breeders/kitten or puppy mills. These people breed to make money. Sometimes they are obvious in their quest for cash, and sometimes less obvious(pictures of their children and the new puppies and kittens). They usually get rid of their puppies and kittens as soon as possible. Sometimes 6-10 weeks of age. However, even the ones who do send them home at more appropriate times, the money from puppies and kittens is going straight into their pocket.

They do not do extensive health testing, no pedigree research to learn about their longevity, nor their personality, nor provide genetic testing on their breeding moms and dads, and rely on buyers not knowing any better (also increasing the likelihood of being relinquished later on). Sometimes they'll even sell puppies or kittens without a contract of any kind!
 
Though it is not 100 percent foolproof you will typically find these people advertising through Kijiji and sites of that nature. As if their babies are a commodity. Maybe you'll get first shots and de-worming if you are lucky. They sell their animals to generally the first person that comes along with enough money. "Kittens need to go home asap- no holds first come first serve!". They often have kittens or puppies just simply available for sale at any given time (as opposed to a wait list), proving that quantity is their goal and not quality.
 
******These are also the people that give reputable responsible breeders a very bad name and are the root cause people sometimes turn up their nose at a "purebred"*****
 
4) Pet owners relinquishing their pets due to behavior issues, costly medical treatment, moving, allergies, having a child etc.
These four groups encompass where the majority of all pets in shelters arrive from.

The entire point of a reputable breeder, of cats or dogs(and countless other domestic animals) is to preserve the breed, by way of producing only the best offspring, this means predictability, predictability of temperament, personality, looks, physical health/soundness and mental health/soundness. Predictability is what it is all about. When you choose healthy, well-bred parents who fit all these categories, you have a very high chance of producing kittens with those same qualities. Choosing a purebred (and wellbred) kitten is simply another choice in being a responsible pet parent. It's ok to want something predictable, whether it be because you have allergies, because you have had animals with health issues in the past and want a better chance at avoiding that or seeing them suffer, whether it be because you simply recognize the value of the likelyhood of signficantly less headaches, less heartache and less cost over their lifetime, or because you think a certain personality would fit best in your family. It's a responsible choice, and too often people feel shamed, due to judgements of others who frankly mean well, but don't understand these points.
​
So why is a reputable breeder different though? How are they actually part of the solution to help prevent pets in shelters? Typically a reputable breeder does the following things to ensure their cats and kittens(though much of this applies to responsible dog breeders as well) NEVER wind up contributing to the overpopulation of shelters and rescues.

1. A contract that among many other things stipulates that if the new owner AT ANY TIME in the pets life can no longer care for the pet for any reason (as well as specifically forbidding the relinquishment to a shelter or research facility) they can be returned to the breeder. (Ensuring they do not wind up in a shelter-ever.)

2. In the event that the new owner dies and their family isn't aware of the contract, or for some reason forgets or for some reason cannot contact the breeder, the microchip given to the kitten/puppy has the breeders information on it. So that in the unlikely event of finding themselves in a shelter or vet clinic/rescue, the breeder can collect the pet if needed. Again ensuring it never clogs the shelter environment.

3. Spayed and neutered kittens before being placed into new homes, ensuring there will never be an oops litter, never be placed into the hands of someone with the intention to become a backyard breeder or kitten mill. Never have to worry about them running loose while unaltered, though every breeder contract I have ever seen has made certain the cat will be indoor only anyhow, even if they somehow managed to scoot out the door undetected, it's not an issue. **This is different with puppies because of how they develop physiologically but reputable dog breeders have various other methods to ensure as best they can, the dogs don’t breed when placing them in a new home.

4. Consistent health testing of all breeding age cats and dogs AND proper socialization. This alone means people that relinquish their pets for behavior problems or costly medical issues they can't afford, have way less of a chance of ever encountering this in the first place(and even if they did, as mentioned the breeder would be there to collect the pet anyhow).

As with any complex issue, it’s vital to look at where the problem of overpopulation in shelters stems from. A quality breeder, is not the concern and in fact promotes not only responsible pet ownership, but lifetime commitment to the animals they bring into the world along with lifetime support for their families.

If you love a breed, any breed at all, but hate responsible breeders by lumping them together with backyard breeders or mills, where do you expect that breed to come from?

Imagine if you will that breeders entirely disappeared.....
The only pets left would be those from the sources discussed above. Is that what you want to support instead?

Wouldn’t it be nice to solve the problems in the list above and instead have puppies and kittens (and other companion animals) always born into loving experienced hands that want them? To wait lists of wonderful loving homes that understand the care and work and the plethora of learning and heartache and research that goes into raising each new life?

Let’s briefly address that elephant in the room at this point. Shelters are usually(but ironically not always) cheaper than purchasing from a reputable breeder.

Yes. A well bred pet costs quite a bit of money. The price tag on a pet does NOT necessarily mean the breeder has done all the things we talked about. But a good breeder will have an accompanying price tag. 

Why?
a) We don’t get donations of food, or toys, or furniture or grooming supplies or anything else. We pay for it.
b) We don’t get subsidized costs at the vet. We pay full price for everything. Possibly a frequency discount, I’ve seen those before. But vets don’t volunteer their time for health checks, vaccines. Surgeries (spay or neuter or emergency), sickness etc.
c) Shelters don’t pay for genetic or physical specialty health testing on their pets to be sure they don’t have inheritable diseases. Responsible breeders do.
d) Shelters don’t pay for specialized routine testing (like echo-cardiograms for instance) to ensure that the animals they have, have as much longevity and health as possible. Responsible breeders do.
e) Shelters don’t travel around the continent to attend shows and have unbiased educated judges act as a peer review for their adherence to standard(and yes to be handled well and to travel well means you are also cultivating the best personalities possible). Responsible breeders do.
f) Shelters generally don’t feed the highest quality foods available because they simply cannot afford to(with general exceptions for animals with allergies/intolerances). Responsible breeders do.

But you might say there are people out there that can’t afford those prices regardless of what you get for them. Retired adults are certainly a more cost effective way to go. But also.... speaking for myself personally.... as a breeder I have offered people I trust, cats at no cost at all. Spayed/neutered and vaccinated etc. With different arrangements to make that possible(like allowing me to attend shows with them in the future as an example). Naturally these are people I trust, but all it takes is establishing a friendship with a breeder and allowing them to get to know you.

Speaking for myself personally as a pet owner, long before I was involved in the breed, I made barely above minimum wage and scrimped and saved for more than a year to purchase a cat from a reputable breeder. It can be done for most people given enough time. A year or two of saving for anything worthwhile is usually worth it. Think of it as any other larger investment.

If you do decide to adopt from a shelter or rescue(and we wholeheartedly support your choice if you do- in fact in Manitoba we will even help you find some great ones!) please make sure it is one that can attest to how they help trying to solve the problem of overpopulation rather than just trying to find homes for the results of other people's poor decisions. Otherwise It's treating the symptom. Not the problem. You may not have known there was such a thing as irresponsible rescues, but there are. Unfortunately that would make this an even longer post to outline, so that will have to wait for some other time.

Even after all this, some people might say, "Well sure fine, but I'd never buy a purebred because crossbreeds are healthier than purebreds!".

That's patently untrue for a number of reasons.

I’ll offer an example: Say you have two crossbreed dogs, of unknown origin have no way of knowing what is in their genetic makeup....
Perhaps one parent had hip dysplasia, and the other had luxating patellas (loose kneecaps). Combine them and you could have puppies with BOTH. Shelters frequently have special needs animals. When not the cause of trauma(like heaven forbid an animal is attacked by another animal, or hit by a car, lost an eye in a fight etc), the causes are usually either congenital or hereditary, for instance joint issues and behavioral issues are both massively influenced by genetics.

Just because they are not of the same breed doesn't mean they can't pass on traits they have just because the second parent doesn't. That's not how genetics works.

Another example would be your own doctor visit. The doctor might ask you "what kind of ailments do you have in your family history?" And you say, "well my father had heart disease and my mother suffered from diabetes and osteoarthritis". No doctor is going to tell you, "oh well then! That's fine at least they both had different things! That means you won't get them!" Nope. Flawed logic at its finest.

Yes, if both parents have the same issue, it makes a puppy or kitten more likely to have it but that also means a reputable/ethical breeder wouldn't be breeding those two animals together(hence the use of genetic (and physical radiograph/specialist) testing and making informed careful health related decisions with each individual breeding animal they chose to use. And when you don't know the parents you simply cannot know the family history.

These are only physical examples, but the same holds true for personality. Pets that have high anxiety problems, destructive behavior, excessive shyness also pass on those traits, and it is part of a breeders job to produce great examples of the breed not only physically but mentally. Naturally, they are also individuals and genetics isn't the ONLY influence, but it is a major one not to be overlooked. Here is a pretty recent study on exactly that.

For example, to protect our kittens against possible health issues, HCM screens(echo-cardiogram) are done roughly every 12-18 months as well as ones done on their lineage(where we got OUR cats from!), genetic testing is now available for both PKD and CMS to confirm the cat does not carry the gene that causes either. Does that means it's a guarantee a cat or kitten will never get sick? No of course not. Just like children they can catch colds, just like aging adults age related diseases happen etc. but eliminating the problem out of a gene pool where possible, is a whole lot better than hoping a cat or kitten doesn't get something in the future.

So I hope this gives you some food for thought, and if you want to share this post with someone, please do. We welcome questions and open dialogue.

TLDR: it’s in every pets best interest to support both Responsible breeders AND Responsible rescues
"
      }
    },
    {
      "@type": "Question",
      "name": "Question 6: Are Devon Rex hypoallergenic?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 6: No. There is no such thing as a fully hypoallergenic cat in the most widely recognized meaning of the word. Despite what you may have read. All cats create the proteins that cause allergies in humans. Technically, being hypoallergenic just means less allergenic, not no allergens. But most people associate it with being an allergy safe option. But they are not. 
"
      }
    },
    {
      "@type": "Question",
      "name": "Question 7: Are Devon Rex considered non-shedding?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 7: No. Again, no animal with fur is truly non shedding. Not dogs or cats. But there are varying degrees, and most Devons shed very little-often far less than your average cats. Additionally you may find people that raise Devons to look very much like Sphynx. With very little fur at all. This is not the breed standard, and as we actively show, we do aim to breed to the standard. There will be some variation even in the same litter, but do not expect your kitten to be bald.​ You will also typically see that most Devon kittens go through some degree of molting(losing their coat) around 8 weeks of age and coming back around 5 or 6 months though it can take up to a year to get their full coat back in. However, a good indicator of whether a kitten will have coat(and to what degree) when they get older  are if both parents and all grandparents have coat and how well coated those adults are. However, there are a few breeds that can be "easier" on allergies than others. Devon Rex do fit into that category. For people with mild to moderate cat allergies, Devons may provide some relief, as they tend to have minimal shedding, therefor less ways to leave their proteins in their environment."
      }
    },
    {
      "@type": "Question",
      "name": "Question 8: Can I come check out your cats to see if I am allergic?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 8: We do allow you to come and visit the kitten you are potentially going to take home, if you are...
1. In town and 
2. We don't have any unvaccinated neonates at that time. 

However, because we also have two exotic shorthairs, as well as our dogs, ours is NOT a place we recommend to test for allergies. Truth be told though, we used to have the ability to have people visit a friend who had just 3 Devons, and all allergic visitors had some type of reaction, even if mild.

As discussed in other questions here, they are not hypoallergenic, but might provide some relief to those with mild allergies, or those with mild-moderate allergies who are willing to take medication. "
      }
    },
    {
      "@type": "Question",
      "name": "Question 9: Do you ship your kittens or cats?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 9: No. For felines in particular it is not a good or safe way to travel. Exposure to significant stress(the biggest predictor of illness in cats), smells, and even contagious airborne illnesses, it is not something we are willing to subject our cats to. You are required to come in person to collected your new family member, or you are able to hire, at your cost, a courier to bring your kitten to you and travel in cabin with your new kitten/cat(this ranges from 400-600 US for most places in Canada or the US)"
      }
    },
    {
      "@type": "Question",
      "name": "Question 10: How are your cats/kittens socialized?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 10: Our kittens and cats are socialized from birth with constant handling, are strictly raised in our home, and as they progress and are properly vaccinated, they are introduced to other cats and dogs. 

We also get them used to weekly bathing in order to help acclimatize them to the feeling and sound of water so that homes have the ability to bathe them if they feel the need. 

Rest assured, very very few cats really love baths, but this helps to get them used to it. In order to have a cat that stays ok with this it is important to maintain it, it does not have to be a full bath every week but every 3 or 4 to keep them from being terribly afraid or dangerous during bath time(if you find baths necessary)."
      }
    },
    {
      "@type": "Question",
      "name": "Question 11: I want to breed Devons! Can I buy a breeding cat from you?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 11: Honestly, the short answer is no. 

The long answer, is I work with people I have an established relationship with, people I have met through show and gotten to know. People that have the same ethics as I do when it comes to breeding cats. I need to trust you. Trust like this, takes time. These are my babies, and I want to make sure the lines I have worked so hard for are handled in ways we agree with(much of which is outlined here).
 
- If you are interested in breeding, I will tell you what most reputable breeders will.... Start with an alter prospect to show, to find out if you really like it. This will help you meet people and establish those all important relationships. Learn more about showing and breeding and all that goes into it(and believe me, this page just scratches the surface). I will absolutely assist you with this if you are even slightly local! And sometimes help put you in touch with others if you are further away. 
 
- If you are already an established breeder of another breed, it falls back to needing to know and trust you. 
​
Additionally, you will be able to find someone who will sell you a cat with "breeding rights" somewhere, for enough money(sometimes absolutely preposterous amounts of money). However, starting your role as a new breeder with cats that have not been health tested, and without building a foundation of knowledge, without showing, it will be very hard to get quality cats in the future. Starting your breeding program this way, is part of the definition of "Backyard Breeder". Not a group I think most people would want to be a part of.
​
If you find yourself in this position and you have come to see that doing things differently may be in your best interest, drop us a line. I am happy to help point you in helpful directions. Alternatively, we can make arrangements to travel up to 4 hours from Winnipeg to meet people. For instance, we have many times met USA based kitten homes in Fargo, North Dakota. "
      }
    },
    {
      "@type": "Question",
      "name": "Question 12: What is pet insurance and Why do you include it? ",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 12: Pet Insurance is insurance to cover your cat or dog for costs they may incur from an illness or an Accident at the Veterinarian. We support and offer a 6 week insurance trial with each of our kittens. We recommend continuing it.
 
While reputable breeders will do everything in their power to avoid breed related problems, our pets are living breathing creatures and there are some things we cannot protect them against. Accidents, Illnesses, and everything in between. Kittens in particular will run, and jump and play. Everything from a pulled tendon, to a broken leg. They will get into things they shouldn't. Swallowing an elastic, or a part of a cat toy. Those costs can range from a couple hundred to a few thousand with surgery and recovery. I NEVER want to see any of my adopters have to make the heartbreaking choice of whether they can afford treatment or the possibility of their baby crossing the rainbow bridge instead (or honestly, just not getting the best care possible due to finances).
 
For me personally, knowing my own cats (and dogs!) are covered, while yes, a small cost each month is worth the piece of mind in the event I need it. I've seen far too many people fall prey to the "i'll just put money aside" mentality, only to have it backfire in times of need. If you get one of our kittens, or even a shelter kitten, 

looking into Petsecure insurance is one of the safest decisions you can make for your new addition.
"
      }
    },
    {
      "@type": "Question",
      "name": "Question 13: Do you shave/perm/curl their fur to look that way?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 13: No, aside from show baths, and keeping ears and faces clean, there is not much left in the way of grooming Devons. This is really how they look, as nature intended!"
      }
    },
    {
      "@type": "Question",
      "name": "Question 14: Do you have any longhaired Devons for sale?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Answer 14: NO. We are aware that there are some Canadian catteries that have longhair Devons and choose to breed them. THIS IS NOT THE BREED STANDARD in CFA, TICA, ACFA or CCA. It is a an automatic disqualification/withhold of points/titles in all North American associations. 

Trouble is, as kittens, unless a judge is very Devon savvy, they could miss a longhaired Devon kitten(look a little like a Selkirk rex in terms of coat but with a Devon head). You can typically recognize them by their longer tail fur and furnishings. With age it will become more and more apparent. 
 
This is akin to having a longhaired Boston Terrier, or a long haired Labrador, or a longhaired Boxer. You probably haven't seen those before, because it is simply not part of what makes the breed, the breed. It often also will mean they haven't tested their cats genetically. And at best, this signifies a breeder does not care about breed standard, or perhaps know the breed well enough to know better. 

With the advent of DNA testing panels, it isn't as common as it once was, but occasionally a breeder might decide to paid two cats together who are both shorthair but who both carry longhair (and therefore together have a chance of having a kitten be longhaired). They may decide that the combination of other attributes is so beneficial to the breed, or their program that they are willing to risk having some longhairs.... and it IS a risk. Because those kittens might happen to be the best in the litter and the breeder could not keep them as they wouldn't be able to prove them in front of an unbias and educated third party (judge). So very occasionally you may see a longhaired Devon kitten for sale as a pet. Assuming the breeder isn't consistently or deliberately breeding/advertising longhairs, that's not an issue. It is the breeding OF the longhair Devon, or deliberate ongoing creation of them. If you happen to be more familiar with dogs, this is akin to "Fluffy Frenchies", which are also considered to be unethical as a result. 

Lastly, there are even some breeders who attempt to excuse this by citing that the first Devon Rex,  Kirlee himself, as having carried longhair, and while we do not have any DNA from Kirlee to prove conclusively, there are some records to indicate through test matings that he may have carried longhair. Or that it may have been introduced by other breeds like the Persian in VERY early development of the breed, back in the 60's/70's. Either way, this argument doesnt pass a basic logic test. The breed has a written standard now. In it's most literal interpretation, it specifies that the cats must be shorthair. If we start to ignore parts of the standard based on our own likes/dislikes, then it means nothing. Someone could make the same argument that they love the look and personality of a Devon, but maybe not the curly fur. Which is of course also called for in the standard. It took decades to be accepted/approved. Countless cats and humans, countless hours of work and time. It deserves to be respected. If you can't respect the standard, you can't respect the breed. 

Of course, it is not a health related attribute, but a great many things are not health related that help define a breed(any breed). Things like the shape of their head, the curl of their coat, their personality, or any other heritable trait. It is part of what makes a Devon, a Devon. 
 
 If you like the look of a longhaired Devon, please look into a Selkirk rex, a Tennessee Rex or even a LaPerm. "
      }
    }
  ]
}

